app/views/product/_product.html.erb

      <%# <b>Category: </b> <%= @categories.all %>
      <b>Category: </b> <%= product.categories.map { |cat| cat.name }.join(", ") %><br>
---
SELECT "categories".* FROM "categories" INNER JOIN "product_categories" ON "categories"."id" = "product_categories"."category_id" WHERE "product_categories"."product_id" = ?  [["product_id", 7]]